Reports/УДАЛИТЬ_СводныйОтчетМенеджераПродажПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>УДАЛИТЬ_СводныйОтчетМенеджераПродажПоЗаказам</Name>
			<Comment>По заказам покупателей (оптовые продажи)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/УДАЛИТЬ_СводныйОтчетМенеджераПродажПоЗаказам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьСводныйОтчетМенеджераПродажПоЗаказам(ПериодНачало, ПериодКонец, 
															Контрагент = Неопределено, Подразделение = Неопределено)
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ОбъектОтчет.ПолучитьМакет("Макет");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ПериодНачало = Формат(ПериодНачало, "ДЛФ=Д");
	ОбластьМакета.Параметры.ПериодКонец = Формат(ПериодКонец, "ДЛФ=Д");
	Таб.Вывести(ОбластьМакета);
	//НАЧАЛО Хаматов А.Р. 2017-05-05
	Таб.ФиксацияСверху = 5;
	//КОНЕЦ Хаматов А.Р. 2017-05-05
	
	ЗапросВалюта = Новый Запрос;
	ЗапросВалюта.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Валюты.Ссылка КАК Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	НЕ Валюты.ПометкаУдаления";
	ВыборкаВалюта = ЗапросВалюта.Выполнить().Выбрать();
	Пока ВыборкаВалюта.Следующий() Цикл
		
		//данные по заказам на производство
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНаПроизводство.Ссылка,
		|	ВЫРАЗИТЬ(ЗаказНаПроизводство.ПродукцияНомерРасчета КАК СТРОКА(15)) КАК ПродукцияНомерРасчета,
		|	НАЧАЛОПЕРИОДА(ЗаказНаПроизводство.Дата, ДЕНЬ) КАК Дата,
		|	ЗаказНаПроизводство.Контрагент,
		|	ЗаказНаПроизводство.ПродукцияЦена,
		|	ЗаказНаПроизводство.ПродукцияНоменклатураКоличество КАК ПродукцияКоличество,
		|	ЗаказНаПроизводство.Товары.(
		|		Ссылка,
		|		Количество,
		|		Сумма,
		|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|		Коэффициент
		|	),
		|	ЗаказНаПроизводство.Услуги.(
		|		Ссылка,
		|		Количество,
		|		Сумма,
		|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|		Коэффициент
		|	) КАК Услуги,
		|	ЗаказНаПроизводство.СуммаДокумента,
		|	ЗаказНаПроизводство.ТекущийСтатус,
		|	ЗаказНаПроизводство.ПродукцияСумма,
		|	ЗаказНаПроизводство.Материалы.(
		|		Номенклатура,
		|		Количество,
		|		Коэффициент
		|	) КАК Материалы,
		|	ЗаказНаПроизводство.Валюта,
		|	ЗаказНаПроизводство.АдресМонтажа,
		|	ЗаказНаПроизводство.ФактураПотолка.(
		|		Ссылка,
		|		НомерСтроки,
		|		ПродукцияФактура,
		|		ПродукцияЦвет,
		|		ПродукцияКоличество,
		|		Основная
		|	)
		|ИЗ
		|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ГДЕ
		|	ЗаказНаПроизводство.Проведен = ИСТИНА
		|	И ЗаказНаПроизводство.Дата >= &ПериодНачало
		|	И ЗаказНаПроизводство.Дата <= &ПериодКонец
		|	И ЗаказНаПроизводство.ТекущийСтатус <> &Отменен
		|	И ЗаказНаПроизводство.Валюта = &Валюта";
		
		Если НЕ Контрагент = Неопределено Тогда
			Если НЕ Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				Запрос.Текст = Запрос.Текст + "
				|	И ЗаказНаПроизводство.Контрагент = &Контрагент";
			КонецЕсли;
		КонецЕсли;
		Если НЕ Подразделение = Неопределено Тогда
			Если НЕ Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
				Запрос.Текст = Запрос.Текст + "
				|	И ЗаказНаПроизводство.Подразделение = &Подразделение";
			КонецЕсли;
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ПродукцияНомерРасчета";
		
		Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Отменен", Справочники.СтатусыЗаказовНаПроизводство.Отменен);
		Запрос.УстановитьПараметр("Валюта", ВыборкаВалюта.Валюта);
		
		ИтогиПродукцияКоличество = 0;
		ИтогиПродукцияСумма = 0;
		ИтогиПолотноКоличество = 0;
		ИтогиУглыСтоимость = 0;
		ИтогиКривыеСтоимость = 0;
		ИтогиУслугиСтоимость = 0;
		ИтогиМатериалыСтоимость = 0;
		ИтогиСуммаДокумента = 0;
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("Валюта");
			ОбластьМакета.Параметры.Валюта = ВыборкаВалюта.Валюта;
			Таб.Вывести(ОбластьМакета);
			
			Пока ВыборкаЗапроса.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаЗапроса);
				ТекущаяСтрока = ВыборкаЗапроса.ФактураПотолка.Выбрать();
				Пока ТекущаяСтрока.Следующий() Цикл
					Если ТекущаяСтрока.Основная Тогда
						ОбластьМакета.Параметры.ПродукцияЦвет = ТекущаяСтрока.ПродукцияЦвет;
						ОбластьМакета.Параметры.ШиринаПолотна = ТекущаяСтрока.ПродукцияФактура.ШиринаПолотна;
					КонецЕсли;
				КонецЦикла;
				ОбластьМакета.Параметры.Дата = Формат(ВыборкаЗапроса.Дата,"ДЛФ=Д");
				
				ПолотноКоличество = 0;
				ТаблицаМатериалов = ВыборкаЗапроса.Материалы.Выгрузить();
				Для Каждого ТекущаяСтрока Из ТаблицаМатериалов Цикл
					Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
						ПолотноКоличество = ПолотноКоличество + ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьМакета.Параметры.ПолотноКоличество = ПолотноКоличество;
				
				УглыКоличество = 0;
				УглыКоличествоБесплатных = 0;
				УглыКоличествоПлатных = 0;
				УглыСтоимость = 0;
				КривыеКоличество = 0;
				КривыеСтоимость = 0;
				УслугиСтоимость = 0;
				
				ТаблицаУслуг = ВыборкаЗапроса.Услуги.Выгрузить();
				Для Каждого ТекущаяСтрока Из ТаблицаУслуг Цикл
					//Если ТекущаяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.УслугаРаскрояУглов Тогда
					//	УглыКоличество = УглыКоличество + (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
					//	УглыСтоимость = УглыСтоимость + ТекущаяСтрока.Сумма;
					//	Если ТекущаяСтрока.Сумма > 0 Тогда
					//		УглыКоличествоПлатных = УглыКоличествоПлатных + (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент); 
					//	Иначе
					//		УглыКоличествоБесплатных = УглыКоличествоБесплатных + (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
					//	КонецЕсли;						
					//ИначеЕсли ТекущаяСтрока.ВидНоменклатуры = Справочники.ВидыНоменклатуры.УслугаРаскрояКривых Тогда
					//	КривыеКоличество = КривыеКоличество + (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
					//	КривыеСтоимость = КривыеСтоимость + ТекущаяСтрока.Сумма;
					//Иначе
						УслугиСтоимость = УслугиСтоимость + ТекущаяСтрока.Сумма;
					//КонецЕсли;
				КонецЦикла;
				ОбластьМакета.Параметры.УглыКоличество = УглыКоличество;
				ОбластьМакета.Параметры.УглыКоличествоБезП = УглыКоличествоБесплатных;
				ОбластьМакета.Параметры.УглыКоличествоПлатных = УглыКоличествоПлатных;
				ОбластьМакета.Параметры.УглыСтоимость = УглыСтоимость;
				ОбластьМакета.Параметры.КривыеКоличество = КривыеКоличество;
				ОбластьМакета.Параметры.КривыеСтоимость = КривыеСтоимость;
				ОбластьМакета.Параметры.УслугиСтоимость = УслугиСтоимость;
				
				ТаблицаТоваров = ВыборкаЗапроса.Товары.Выгрузить();
				МатериалыСтоимость = ТаблицаТоваров.Итог("Сумма");
				ОбластьМакета.Параметры.МатериалыСтоимость = МатериалыСтоимость;
				
				Таб.Вывести(ОбластьМакета);
				
				ИтогиПродукцияКоличество = ИтогиПродукцияКоличество + ВыборкаЗапроса.ПродукцияКоличество;
				ИтогиПродукцияСумма = ИтогиПродукцияСумма + ВыборкаЗапроса.ПродукцияСумма;
				ИтогиПолотноКоличество = ИтогиПолотноКоличество + ПолотноКоличество;
				ИтогиУглыСтоимость = ИтогиУглыСтоимость + УглыСтоимость;
				ИтогиКривыеСтоимость = ИтогиКривыеСтоимость + КривыеСтоимость;
				ИтогиУслугиСтоимость = ИтогиУслугиСтоимость + УслугиСтоимость;
				ИтогиМатериалыСтоимость = ИтогиМатериалыСтоимость + МатериалыСтоимость;
				ИтогиСуммаДокумента = ИтогиСуммаДокумента + ВыборкаЗапроса.СуммаДокумента;
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.ИтогиПродукцияКоличество = ИтогиПродукцияКоличество;
			ОбластьМакета.Параметры.ИтогиПродукцияСумма = ИтогиПродукцияСумма;
			ОбластьМакета.Параметры.ИтогиПолотноКоличество = ИтогиПолотноКоличество;
			ОбластьМакета.Параметры.ИтогиУглыСтоимость = ИтогиУглыСтоимость;
			ОбластьМакета.Параметры.ИтогиКривыеСтоимость = ИтогиКривыеСтоимость;
			ОбластьМакета.Параметры.ИтогиУслугиСтоимость = ИтогиУслугиСтоимость;
			ОбластьМакета.Параметры.ИтогиМатериалыСтоимость = ИтогиМатериалыСтоимость;
			ОбластьМакета.Параметры.ИтогиСуммаДокумента = ИтогиСуммаДокумента;
			ОбластьМакета.Параметры.Валюта = ВыборкаВалюта.Валюта;
			Таб.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	ТаблицаОтчета = СформироватьСводныйОтчетМенеджераПродажПоЗаказам(Отчет.ПериодНачало, Отчет.ПериодКонец, Отчет.Контрагент, Отчет.Подразделение);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПериодНачало = НачалоМесяца(ТекущаяДата());
	Отчет.ПериодКонец = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если ПолучитьКоличествоСтраницВОтчете() = 0 Тогда
		ПоказатьОповещениеПользователя("Сначала необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
		
	Если Вопрос("Создать новое электронное письмо?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмоСОтчетом();
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтраницВОтчете()
	Возврат ТаблицаОтчета.КоличествоСтраниц();
КонецФункции

&НаСервере
Функция СформироватьЭлектронноеПисьмоСОтчетом()
	
	Возврат РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(ТаблицаОтчета, "Сводный отчет по заказам", Отчет.Контрагент, "xls", Истина);
		
КонецФункции
